Revit 2026 API

# WorksetConfiguration Class

---

A configuration class that is passed in to methods that open Revit documents to specify which user-created worksets are opened/closed.

SystemObject Autodesk.Revit.DBWorksetConfiguration

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class WorksetConfiguration : IDisposable
```
```vb
Public Class WorksetConfiguration
	Implements IDisposable
```
```cpp
public ref class WorksetConfiguration : IDisposable
```
```fsharp
type WorksetConfiguration =
    class
        interface IDisposable
    end
```

The WorksetConfiguration type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | WorksetConfiguration | Constructs a new workset configuration with an initial setting to open all user-created worksets. |
|  | WorksetConfiguration(WorksetConfiguration) | Constructs a new copy of the input WorksetConfiguration object. |
|  | WorksetConfiguration(WorksetConfigurationOption) | Constructs a new workset configuration with an initial setting to open or close all user-created worksets, or to open last viewed worksets. |

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Close |  |
|  | Dispose | Releases all resources used by the WorksetConfiguration |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | Open |  |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

Once an instance of this class is created, it can be further modified by calling any of the other methods in any order. It is a specification of a setting for model open; the methods of this class just adjust the specification, and do not themselves open or close worksets.

Only user-created worksets can be specified to be opened or closed. All system worksets are automatically open. An open workset allows its elements can be expanded and displayed. For a closed workset, Revit tries to not expand its elements, and to that end, does not display them. This is intended to help with performance by reducing Revit's memory footprint.

#### Reference

Autodesk.Revit.DB Namespace